// Напишите функцию pow(x,n), которая возводит x в степень n и возвращает результат.

// pow(3, 2) = 3 * 3 = 9
// pow(3, 3) = 3 * 3 * 3 = 27
// pow(1, 100) = 1 * 1 * ...* 1 = 1
// Создайте страницу, которая запрашивает x и n, а затем выводит результат pow(x,n).

// P.S. В этой задаче функция обязана поддерживать только натуральные значения n, т.е. целые от 1 и выше.

// пример не предусматривает натуральные значения. просто возводит в степень



// let x = prompt('Введите число  x');

// let n = prompt('Введите cтепень  n');

// function pow(x, n) {

//     let result = x ** n; 

//     return alert (`Результ возведения числа в степень ${result}`);

// }


// pow(x, n);